(function (root) {
	root.c_item = {
     "10001": {
          "Id": 10001,
          "name": "扫荡券",
          "type": 0,
          "effect": {},
          "icon": "10001",
          "desc": "增加1次扫荡机会"
     },
     "40001": {
          "Id": 40001,
          "name": "小经验药水",
          "type": 1,
          "effect": {
               "exp": 50
          },
          "icon": "40001",
          "desc": "使用后获得50经验"
     },
     "40002": {
          "Id": 40002,
          "name": "中经验药水",
          "type": 1,
          "effect": {
               "exp": 200
          },
          "icon": "40002",
          "desc": "使用后获得200经验"
     },
     "40003": {
          "Id": 40003,
          "name": "大经验药水",
          "type": 1,
          "effect": {
               "exp": 500
          },
          "icon": "40003",
          "desc": "使用后获得500经验"
     },
     "40004": {
          "Id": 40004,
          "name": "超级经验药水",
          "type": 1,
          "effect": {
               "exp": 1000
          },
          "icon": "40004",
          "desc": "使用后获得1000经验"
     },
     "40005": {
          "Id": 40005,
          "name": "金币",
          "type": 2,
          "effect": {
               "gold": 100
          },
          "icon": "40005",
          "desc": "使用后获得100金币"
     },
     "40006": {
          "Id": 40006,
          "name": "钱匣",
          "type": 2,
          "effect": {
               "gold": 1000
          },
          "icon": "40006",
          "desc": "使用后获得1000金币"
     },
     "40007": {
          "Id": 40007,
          "name": "钱袋",
          "type": 2,
          "effect": {
               "gold": 10000
          },
          "icon": "40007",
          "desc": "使用后获得10000金币"
     },
     "40008": {
          "Id": 40008,
          "name": "钱箱",
          "type": 2,
          "effect": {
               "gold": 100000
          },
          "icon": "40008",
          "desc": "使用后获得100000金币"
     },
     "40009": {
          "Id": 40009,
          "name": "钻石",
          "type": 3,
          "effect": {
               "diamond": 6
          },
          "icon": "40009",
          "desc": "使用后获得6钻石"
     },
     "40010": {
          "Id": 40010,
          "name": "一把钻石",
          "type": 3,
          "effect": {
               "diamond": 380
          },
          "icon": "40010",
          "desc": "使用后获得380钻石"
     },
     "40011": {
          "Id": 40011,
          "name": "一袋钻石",
          "type": 3,
          "effect": {
               "diamond": 1350
          },
          "icon": "40011",
          "desc": "使用后获得1350钻石"
     },
     "40012": {
          "Id": 40012,
          "name": "一大袋钻石",
          "type": 3,
          "effect": {
               "diamond": 3000
          },
          "icon": "40012",
          "desc": "使用后获得3000钻石"
     },
     "40013": {
          "Id": 40013,
          "name": "一箱钻石",
          "type": 3,
          "effect": {
               "diamond": 5550
          },
          "icon": "40013",
          "desc": "使用后获得5550钻石"
     },
     "40014": {
          "Id": 40014,
          "name": "一车钻石",
          "type": 3,
          "effect": {
               "diamond": 12200
          },
          "icon": "40014",
          "desc": "使用后获得12200钻石"
     },
     "40015": {
          "Id": 40015,
          "name": "无敌经验药水",
          "type": 1,
          "effect": {
               "exp": 2000
          },
          "icon": "40015",
          "desc": "使用后获得2000经验"
     },
     "40016": {
          "Id": 40016,
          "name": "逆天经验药水",
          "type": 1,
          "effect": {
               "exp": 5000
          },
          "icon": "40016",
          "desc": "使用后获得5000经验"
     }
};
	})(Game);